/* automatically generated by rust-bindgen 0.72.1 */

#[doc = " @struct Score result."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct flx_result {
    pub score: ::std::os::raw::c_int,
    pub indices: *mut ::std::os::raw::c_int,
    pub tail: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of flx_result"][::std::mem::size_of::<flx_result>() - 24usize];
    ["Alignment of flx_result"][::std::mem::align_of::<flx_result>() - 8usize];
    ["Offset of field: flx_result::score"][::std::mem::offset_of!(flx_result, score) - 0usize];
    ["Offset of field: flx_result::indices"][::std::mem::offset_of!(flx_result, indices) - 8usize];
    ["Offset of field: flx_result::tail"][::std::mem::offset_of!(flx_result, tail) - 16usize];
};
unsafe extern "C" {
    #[doc = " Free result.\n @param *result The score result to free."]
    pub fn flx_free(result: *mut flx_result);
}
unsafe extern "C" {
    #[doc = " Return best score matching QUERY against STR.\n @param *str String to test.\n @param *query Query use to score."]
    pub fn flx_score(
        str_: *const ::std::os::raw::c_char,
        query: *const ::std::os::raw::c_char,
    ) -> *mut flx_result;
}
